{"keras_version": "1.2.1", "class_name": "Model", "config": {"output_layers": [["dense_40", 0, 0]], "input_layers": [["input_4", 0, 0]], "name": "model_4", "layers": [{"name": "input_4", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 66, 200, 3], "input_dtype": "float32", "name": "input_4", "sparse": false}, "inbound_nodes": []}, {"name": "lambda_8", "class_name": "Lambda", "config": {"trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001zr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u001f<ipython-input-75-31614bc0a76e>\u00da\b<lambda>)\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "output_shape_type": "raw", "arguments": {}, "name": "lambda_8", "output_shape": null}, "inbound_nodes": [[["input_4", 0, 0]]]}, {"name": "convolution2d_36", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "border_mode": "valid", "W_regularizer": null, "nb_row": 5, "subsample": [2, 2], "activation": "linear", "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "nb_filter": 24, "name": "convolution2d_36", "bias": true, "nb_col": 5}, "inbound_nodes": [[["lambda_8", 0, 0]]]}, {"name": "elu_68", "class_name": "ELU", "config": {"trainable": true, "name": "elu_68", "alpha": 1.0}, "inbound_nodes": [[["convolution2d_36", 0, 0]]]}, {"name": "dropout_28", "class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_28"}, "inbound_nodes": [[["elu_68", 0, 0]]]}, {"name": "convolution2d_37", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "border_mode": "valid", "W_regularizer": null, "nb_row": 5, "subsample": [2, 2], "activation": "linear", "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "nb_filter": 36, "name": "convolution2d_37", "bias": true, "nb_col": 5}, "inbound_nodes": [[["dropout_28", 0, 0]]]}, {"name": "elu_69", "class_name": "ELU", "config": {"trainable": true, "name": "elu_69", "alpha": 1.0}, "inbound_nodes": [[["convolution2d_37", 0, 0]]]}, {"name": "dropout_29", "class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_29"}, "inbound_nodes": [[["elu_69", 0, 0]]]}, {"name": "convolution2d_38", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "border_mode": "valid", "W_regularizer": null, "nb_row": 5, "subsample": [2, 2], "activation": "linear", "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "nb_filter": 48, "name": "convolution2d_38", "bias": true, "nb_col": 5}, "inbound_nodes": [[["dropout_29", 0, 0]]]}, {"name": "elu_70", "class_name": "ELU", "config": {"trainable": true, "name": "elu_70", "alpha": 1.0}, "inbound_nodes": [[["convolution2d_38", 0, 0]]]}, {"name": "dropout_30", "class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_30"}, "inbound_nodes": [[["elu_70", 0, 0]]]}, {"name": "convolution2d_39", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "border_mode": "valid", "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "activation": "linear", "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "nb_filter": 64, "name": "convolution2d_39", "bias": true, "nb_col": 3}, "inbound_nodes": [[["dropout_30", 0, 0]]]}, {"name": "elu_71", "class_name": "ELU", "config": {"trainable": true, "name": "elu_71", "alpha": 1.0}, "inbound_nodes": [[["convolution2d_39", 0, 0]]]}, {"name": "dropout_31", "class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_31"}, "inbound_nodes": [[["elu_71", 0, 0]]]}, {"name": "convolution2d_40", "class_name": "Convolution2D", "config": {"activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "border_mode": "valid", "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "activation": "linear", "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "nb_filter": 64, "name": "convolution2d_40", "bias": true, "nb_col": 3}, "inbound_nodes": [[["dropout_31", 0, 0]]]}, {"name": "elu_72", "class_name": "ELU", "config": {"trainable": true, "name": "elu_72", "alpha": 1.0}, "inbound_nodes": [[["convolution2d_40", 0, 0]]]}, {"name": "dropout_32", "class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_32"}, "inbound_nodes": [[["elu_72", 0, 0]]]}, {"name": "flatten_8", "class_name": "Flatten", "config": {"trainable": true, "name": "flatten_8"}, "inbound_nodes": [[["dropout_32", 0, 0]]]}, {"name": "dense_36", "class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "output_dim": 1164, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "input_dim": 1152, "name": "dense_36", "bias": true}, "inbound_nodes": [[["flatten_8", 0, 0]]]}, {"name": "elu_73", "class_name": "ELU", "config": {"trainable": true, "name": "elu_73", "alpha": 1.0}, "inbound_nodes": [[["dense_36", 0, 0]]]}, {"name": "dropout_33", "class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_33"}, "inbound_nodes": [[["elu_73", 0, 0]]]}, {"name": "dense_37", "class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "output_dim": 100, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "input_dim": 1164, "name": "dense_37", "bias": true}, "inbound_nodes": [[["dropout_33", 0, 0]]]}, {"name": "elu_74", "class_name": "ELU", "config": {"trainable": true, "name": "elu_74", "alpha": 1.0}, "inbound_nodes": [[["dense_37", 0, 0]]]}, {"name": "dropout_34", "class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_34"}, "inbound_nodes": [[["elu_74", 0, 0]]]}, {"name": "dense_38", "class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "output_dim": 50, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "input_dim": 100, "name": "dense_38", "bias": true}, "inbound_nodes": [[["dropout_34", 0, 0]]]}, {"name": "elu_75", "class_name": "ELU", "config": {"trainable": true, "name": "elu_75", "alpha": 1.0}, "inbound_nodes": [[["dense_38", 0, 0]]]}, {"name": "dropout_35", "class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_35"}, "inbound_nodes": [[["elu_75", 0, 0]]]}, {"name": "dense_39", "class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "output_dim": 10, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "input_dim": 50, "name": "dense_39", "bias": true}, "inbound_nodes": [[["dropout_35", 0, 0]]]}, {"name": "elu_76", "class_name": "ELU", "config": {"trainable": true, "name": "elu_76", "alpha": 1.0}, "inbound_nodes": [[["dense_39", 0, 0]]]}, {"name": "dense_40", "class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "output_dim": 1, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "b_constraint": null, "input_dim": 10, "name": "dense_40", "bias": true}, "inbound_nodes": [[["elu_76", 0, 0]]]}]}}